"""
难度系数：***

2,3,5,7,11,13,…是素数序列。
类似：7,37,67,97,127,157 这样完全由素数组成的等差数列，叫等差素数数列。
上边的数列公差为30，长度为6。

2004年，格林与华人陶哲轩合作证明了：存在任意长度的素数等差数列。
这是数论领域一项惊人的成果！

有这一理论为基础，请你借助手中的计算机，满怀信心地搜索：

长度为10的等差素数列，其公差最小值是多少？

注意：需要提交的是一个整数，不要填写任何多余的内容和说明文字。
"""

# Todo:李波
# def is_prime(x):
#     for i in range(3, x):
#         if x % i == 0:
#             return False
#     return True
#
#
# def get_dif():
#     for i in range(1000):
#
#
#
# if __name__ == '__main__':
#     # print(is_prime(16))
#     print(get_dif())

